while True:
    n = input('مبلغ را با عدد به تومان  وارد کنید : ')
    if n.isnumeric():
        break

n += "0"
ln = n.zfill(60)
n = int(n)
if n == 0:
    print("صفر ریال")
li = {0: '', 1: 'یک', 2: 'دو', 3: 'سه', 4: 'چهار', 5: 'پنج', 6: 'شش', 7: 'هفت', 8: 'هشت', 9: 'نه', 10: 'ده',
      11: 'یازده', 12: 'دوازده', 13: 'سیزده', 14: 'چهارده', 15: 'پانزده', 16: 'شانزده', 17: 'هفده', 18: 'هجده',
      19: 'نوزده', 20: 'بیست', 30: 'سی', 40: 'چهل', 50: 'پنجاه', 60: 'شصت', 70: 'هفتاد', 80: 'هشتاد', 90: 'نود',
      100: 'صد', 200: 'دویست', 300: 'سیصد', 400: 'چهارصد', 500: 'پانصد', 600: 'ششصد', 700: 'هفتصد', 800: 'هشتصد',
      900: 'نهصد'}

big = {0: "", 3: "هزار", 6: "میلیون", 9: "میلیارد", 12: "تریلیون", 15: "کوآدریلیون", 18: "کوینتیلیون", 21: "سکستیلیون",
       24: "سپتیلیون", 27: "اکتیلیون", 30: "نانیلیون", 33: "دسیلیون", 36: "آندسیلیون", 39: "دیودسیلیون",
       42: "تریدسیلیون",
       45: "کواتیوردسیلیون", 48: "کویندسیلیون", 51: "سکسدسیلیون", 54: "سپتدسیلیون", 57: "اکتودسیلیون", 60: "نومدسیلیون"}

v = ""
k = 63
first_check = True
for number in range(0, len(ln), 3):
    num = ln[number] + ln[number + 1] + ln[number + 2]
    k -= 3
    if int(num) != 0:
        start = number
        for x in range(start, len(ln), 3):
            k -= 3
            zero_check = ln[x] + ln[x + 1] + ln[x + 2]
            checker = False
            for i in range(x, x + 3):
                m1 = int(ln[i])
                m2 = (10 ** (len(num) - 1 - (i - x)))
                if i - x == 1 and m1 == 1:
                    checker = True
                    m1 = 0
                if checker and i - x == 2:
                    m1 = m1 + 10
                j = m1 * m2
                if j == 0 or first_check:
                    v = ''
                    if j != 0:
                        first_check = False
                else:
                    v = ' و '
                print(f'{v}{li[j]}', end='')

            if int(zero_check) != 0:
                print(f" {big[k]} ", end='')
        print("ریال")
        break
